kinton/nrf52_expirements/ble_app_uart_non_fs/main.c
/*#define USER_DATA_START 0xED000
#define USER_DATA_SIZE 0x7000
#define FDS_SIZE 0x3000
#define FST_START USER_DATA_START + 0x3000
#define FST_END USER_DATA_START + USER_DATA_SIZE*/
#define FST_START 0xe0000
#define FST_END 0xed000
/*#define FST_START 0x3e000
#define FST_END 0x3ffff*/

#define tokenstart FST_START

// fstorage zone
// 0xED000 -> 0xF4000;
void wait_for_flash_ready(nrf_fstorage_t const * p_fstorage)
{
    /* While fstorage is busy, sleep and wait for an event. */
    while (nrf_fstorage_is_busy(p_fstorage))
    {
        // power_manage();
        idle_state_handle();
    }
}

nrf_fstorage_t fstorage;

static void print_flash_info(nrf_fstorage_t * p_fstorage)
{
    NRF_LOG_INFO("========| flash info |========");
    NRF_LOG_INFO("erase unit: \t%d bytes",      p_fstorage->p_flash_info->erase_unit);
    NRF_LOG_INFO("program unit: \t%d bytes",    p_fstorage->p_flash_info->program_unit);
    NRF_LOG_INFO("==============================");
}

/**@brief   Helper function to obtain the last address on the last page of the on-chip flash that
 *          can be used to write user data.
 */
static uint32_t nrf5_flash_end_addr_get()
{
    uint32_t const bootloader_addr = BOOTLOADER_ADDRESS;
    uint32_t const page_sz         = NRF_FICR->CODEPAGESIZE;
    uint32_t const code_sz         = NRF_FICR->CODESIZE;

    return (bootloader_addr != 0xFFFFFFFF ?
            bootloader_addr : (code_sz * page_sz));
}




/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    NRF_LOG_INFO("CATCHA! %s", p_evt->type);

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        
        NRF_LOG_HEXDUMP_INFO(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        
        // if (p_evt->params.rx_data.p_data[0] == 113) { // == q, 71 in hex
        //     get_and_send_token();
        // }

        NRF_LOG_INFO("rx_data_len: %d", p_evt->params.rx_data.length);
        
        memset(message_handler, 0, sizeof message_handler);
        for (mh_len = 0; mh_len < p_evt->params.rx_data.length; mh_len++)
        {
            message_handler[mh_len] = p_evt->params.rx_data.p_data[mh_len];
            if (mh_len == 255) break;
        }
        
        /* uint16_t length = p_evt->params.rx_data.length;
        uint8_t data_array[p_evt->params.rx_data.length];
        // static char data_array_to_mem[256];
        // for (unsigned char i = 0; i < 256; i++) {
        //     data_array_to_mem = 0x0;
        // }
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            data_array[i] = p_evt->params.rx_data.p_data[i];
            // data_array_to_mem[i] = p_evt->params.rx_data.p_data[i];
        }
        // uint8_t data_array[15] = {'1', '2'};
        // uint16_t length = 15;
        // err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
        // APP_ERROR_CHECK(err_code);*/

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }

        err_code = nrf_fstorage_erase(&fstorage, tokenstart, 1, NULL);
        APP_ERROR_CHECK(err_code);
        // wait_for_flash_ready(&fstorage);

        /*static char     m_hello_world[] = "hello world";
        NRF_LOG_INFO("Writing \"%s\" to flash.", m_hello_world);
        // ed000 -> f4000
        NRF_LOG_INFO("Size: %d", sizeof(m_hello_world));
        // err_code = nrf_fstorage_erase(&fstorage, FST_START, sizeof(m_hello_world), NULL);
        // APP_ERROR_CHECK(err_code);
        err_code = nrf_fstorage_write(&fstorage, FST_START, m_hello_world, sizeof(m_hello_world), NULL);
        APP_ERROR_CHECK(err_code);
        NRF_LOG_INFO("Writed");*/

        // wait_for_flash_ready(&fstorage);

        /*uint8_t    data[256] = {0};
        // Read data.
        // uint32_t const len  = strtol(argv[2], NULL, 10);
        err_code = nrf_fstorage_read(&fstorage, 0xED000, data, sizeof(m_hello_world));
        APP_ERROR_CHECK(err_code);
        NRF_LOG_INFO("Readed: \"%s\"", data);

        uint16_t length = 12;
        err_code = ble_nus_data_send(&m_nus, data, &length, m_conn_handle);
        APP_ERROR_CHECK(err_code);*/
        
