kinton/nrf52_expirements/ble_app_uart_non_fs/main.c
    }
}
static void nus_data_handler_comm(ble_nus_evt_t * p_evt) {
    NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
}


static void read_and_send(void) {
            ret_code_t err_code;
            uint8_t    readed_data[mh_len];
            /*for (int i = 0; i < mh_len; i++) {
              readed_data[i] = 0x0;
            }*/
            // Read data.
            // uint32_t const len  = strtol(argv[2], NULL, 10);
            uint16_t length = sizeof(readed_data);
            err_code = nrf_fstorage_read(&fstorage, tokenstart, readed_data, length);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Readed: \"%s\"", readed_data);
            
            // length = sizeof(readed_data);

            err_code = ble_nus_data_send(&m_nus, readed_data, &length, m_conn_handle);
            APP_ERROR_CHECK(err_code);
}
static void write_from_handler(void) {
            ret_code_t err_code;
            // static char     m_hello_world[] = "hello world";
            static char m_hello_world[tokenlen];
            
            memset(m_hello_world, 0, sizeof m_hello_world);
            for (uint32_t i = 0; i < mh_len; i++)
            {
                m_hello_world[i] = message_handler[i];
                // if (i == 255) break;
            }

            err_code = nrf_fstorage_write(&fstorage, tokenstart, m_hello_world, sizeof(m_hello_world), NULL);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Writed");
}


/**@snippet [Handling the data received over BLE] */
uint32_t ble_nus_init_custom(ble_nus_t * p_nus, ble_nus_init_t const * p_nus_init)
{
    ret_code_t            err_code;
    ble_uuid_t            ble_uuid;
    ble_uuid128_t         nus_base_uuid = {{0x9E, 0xCA, 0xDC, 0x24, 0x0E, 0xE5, 0xA9, 0xE0, 0x93, 0xF3, 0xA3, 0xB5, 0x00, 0x00, 0x40, 0x6E}};
    ble_add_char_params_t add_char_params;

    VERIFY_PARAM_NOT_NULL(p_nus);
    VERIFY_PARAM_NOT_NULL(p_nus_init);

    // Initialize the service structure.
    p_nus->data_handler = p_nus_init->data_handler;

    /**@snippet [Adding proprietary Service to the SoftDevice] */
    // Add a custom base UUID.
    err_code = sd_ble_uuid_vs_add(&nus_base_uuid, &p_nus->uuid_type);
    VERIFY_SUCCESS(err_code);

    ble_uuid.type = p_nus->uuid_type;
    ble_uuid.uuid = 0x0001;

    // Add the service.
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &ble_uuid,
                                        &p_nus->service_handle);
    /**@snippet [Adding proprietary Service to the SoftDevice] */
    VERIFY_SUCCESS(err_code);

    // Add the RX Characteristic (for commands).
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid                     = 0x0002;
    add_char_params.uuid_type                = p_nus->uuid_type;
    add_char_params.max_len                  = maxlenoverble;
    add_char_params.init_len                 = sizeof(uint8_t);
    add_char_params.is_var_len               = true;
    add_char_params.char_props.write         = 1;
    add_char_params.char_props.write_wo_resp = 1;

    add_char_params.read_access  = SEC_OPEN;
    add_char_params.write_access = SEC_OPEN;

    err_code = characteristic_add(p_nus->service_handle, &add_char_params, &p_nus->rx_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add the RX Characteristic (for token inserting)
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid                     = 0x0004;
    add_char_params.uuid_type                = p_nus->uuid_type;
    add_char_params.max_len                  = maxlenoverble;
    add_char_params.init_len                 = sizeof(uint8_t);
    add_char_params.is_var_len               = true;
    add_char_params.char_props.write         = 1;
    add_char_params.char_props.write_wo_resp = 1;

    add_char_params.read_access  = SEC_OPEN;
    add_char_params.write_access = SEC_OPEN;

    err_code = characteristic_add(p_nus->service_handle, &add_char_params, &p_nus->rx_token_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add the TX Characteristic.
    /**@snippet [Adding proprietary characteristic to the SoftDevice] */
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = 0x0003;
    add_char_params.uuid_type         = p_nus->uuid_type;
    add_char_params.max_len           = maxlenoverble;
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    return characteristic_add(p_nus->service_handle, &add_char_params, &p_nus->tx_handles);
    /**@snippet [Adding proprietary characteristic to the SoftDevice] */
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init_custom(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

